'''
Задача 3
Наибольший простой делитель
Простые делители числа 13195 - это 5, 7, 13 и 29.

Каков самый большой делитель числа 600851475143, являющийся простым числом?
'''
# Не решено

a = 600851475143
b = 1
for i in range():
    c = a / b
    b += 1
    if (c % int(c)) == 0:
        print((b - 1), c)

