# Решение элементарных задач(вообще ничего не понимаю как и что делать)
# Обычная сортировка цифр ничего особенного

x = int(input('Введите цифру от 1 до 10: x = '))
y = int(input('Введите цифру от 1 до 10: y = '))
z = int(input('Введите цифру от 1 до 10: z = '))

i = [x, y, z]
i.sort()
print(i)

# метод sort пока что для меня он просто сортирует список. Может сортировать без аргументов(хотя принимает до 3 аргументов) просто по возрастанию целочисленных значений
# пока других решений не нашёл 01.10.2019
